# language: ru

@IgnoreOnWeb

Функционал: Проверка работы документов
	Как Разработчик
	Я Хочу чтобы я мог без ошибок проводить документы

	Сценарий: Открытие_ЗаявкаПокупателя
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_Заказпоставщику
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_АктРассмотренияВозврата
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_ВозвратТоваровОтПокупателя
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_ВозвратТоваровПоставщику
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_ПоступлениеТоваровУслуг
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_РеализацияТоваровУслуг
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_ПеремещениеТоваров
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ

	Сценарий: Открытие_СлужебноеЗадание
	Когда я выбрал последние 10 Документов
	тогда я открываю и провожу документ
